Repository: m4riusz/VatPayerChecker
Catalog: MobileApp/Resources/*.lproj/MobileApp.strings
Languages: pl

# mainViewSearch
source: Search
pl: Szukaj

# mainViewAbout
source: Info
pl: Informacje

source: Find company
pl: Wyszukaj firmę

# name
source: Company (name) or name and surname
pl: Firma (nazwa) lub imię i nazwisko

# nip
source: NIP number, if assigned
pl: Numer, za pomocą którego podmiot został zidentyfikowany na potrzeby podatku, jeżeli taki numer został przyznany

# vatStatus
source: Taxpayer status (as at the check date)
pl: Status podatnika (wg stanu na dzień sprawdzenia)

# vatStatusActive
source: Active
pl: Czynny

# vatStatusExempt
source: Exempt
pl: Zwolniony

# vatStatusNotRegistered
source: Not registered
pl: Niezarejestrowany

# regon
source: REGON number, if assigned
pl: Numer identyfikacyjny REGON, o ile został nadany

# pesel
source: PESEL number, if assigned
pl: Numer PESEL, o ile podmiot posiada

# krs
source: KRS number, if assigned
pl: Numer w Krajowym Rejestrze Sądowym, o ile został nadany

# residenceAddress
source: The address of the permanent place of business or the address of the place of residence, in the case of no fixed place of business address - for a natural person
pl: Adres stałego miejsca prowadzenia działalności albo adres miejsca zamieszkania, w przypadku braku adresu stałego miejsca prowadzenia działalności - w odniesieniu do osoby fizycznej

# workingAddress
source: Registered office address - in the case of an entity which is not a natural person
pl: Adres siedziby – w przypadku podmiotu niebędącego osobą fizyczną

# representatives
source: Names and surnames of the members of the body authorized to represent the entity and their tax identification numbers or PESEL numbers
pl: Imiona i nazwiska osób wchodzących w skład organu uprawnionego do reprezentowania podmiotu oraz ich numery identyfikacji podatkowej lub numery PESEL

# authorizedClerks
source: Names and surnames of proxies and their tax identification numbers or PESEL numbers
pl: Imiona i nazwiska prokurentów oraz ich numery identyfikacji podatkowej lub numery PESEL

# partners
source: Name and surname or company (name) of the partner and his tax identification number or PESEL number
pl: Imię i nazwisko lub firma (nazwa) wspólnika oraz jego numer identyfikacji podatkowej lub numer PESEL

# registrationLegalDate
source: Date of registration as a VAT payer
pl: Data rejestracji jako podatnika VAT

# registrationDenialDate
source: Date of refusal to register as a VAT payer
pl: Data odmowy rejestracji jako podatnika VAT

# registrationDenialBasis
source: Legal ground for refusing registration
pl: Podstawa prawna odmowy rejestracji

# restorationDate
source: Date of restoration as a VAT payer
pl: Data przywrócenia rejestracji jako podatnika VAT

# restorationBasis
source: Legal basis for restoration
pl: Podstawa prawna przywrócenia

# removalDate
source: Date of deregistration as a VAT payer
pl: Data wykreślenia rejestracji jako podatnika VAT

# removalBasis
source: Legal basis for deregistration
pl: Podstawa prawna wykreślenia

# accountNumbers
source: Numbers of settlement accounts or registered accounts at SKOK
pl: Numery rachunków rozliczeniowych lub imiennych rachunków w SKOK

# searchId
source: Search identifier
pl: Identyfikator wyszukiwania

# personCompanyName
source: Company name
pl: Nazwa firmy

# personFirstName
source: First name
pl: Imię

# personLastName
source: Last name
pl: Nazwisko

# searchButton
source: Search
pl: Szukaj

# searchByAccount
source: Account number
pl: Nr konta

# searchByNipPlaceholder
source: Type NIP
pl: Wpisz NIP

# searchByRegonPlaceholder
source: Type REGON
pl: Wpisz REGON

# searchByAccountNumberPlaceholder
source: Type account number
pl: Wpisz numer konta

# loading
source: Searching...
pl: Szukam...

# emptyRegonError
source: REGON can't be empty
pl: REGON nie może być pusty

# invalidRegonFormat
source: Given REGON number has invalid length. 9 or 14 digits required
pl: Podany REGON ma nieprawidłową długość. Wymagane 9 lub 14 znaków

# invalidRegonCharacters
source: Given REGON contains characters that are not allowed. Only digits are allowed
pl: Podany REGON zawiera niedozwolone znaki. Dozwolone są tylko cyfry

# invalidRegon
source: Invalid REGON number
pl: Nieprawidłowy REGON

# emptyAccountNumber
source: Account number can't be empty
pl: Numer konta nie może być pusty

# invalidAccountNumberFormat
source: Given account number has invalid length. 26 digits required
pl: Podany numer konta ma nieprawidłową długość. Wymagane 26 cyfr

# invalidAccountNumberCharacters
source: Given account number contains characters that are not allowed. Only digits are allowed
pl: Podany numer konta zawiera niedozwolone znaki. Dozwolone są tylko cyfry

# invalidAccount
source: Invalid account number
pl: Nieprawidłowy numer konta

# emptyNipError
source: NIP can't be empty
pl: NIP nie może być pusty

# invalidNipFormat
source: Given REGON number has invalid length. 10 digits required
pl: Podany NIP ma nieprawidłową długość. Wymagane 10 znaków

# invalidNipCharacters
source: Given NIP contains characters that are not allowed. Only digits are allowed
pl: Podany NIP zawiera niedozwolone znaki. Dozwolone są tylko cyfry

# invalidNip
source: Invalid NIP number
pl: Nieprawidłowy NIP

# dateTooOldError
source: Given date is before the range of the register
pl: Podana data jest sprzed zakresu rejestru

# apiLimitReachedError
source: The request limit for this IP address has been exhausted for today
pl: Limit żądań dla tego adresu IP został na dziś wyczerpany

# databaseUpdateInProgressError
source: The database is being updated. Please try again later
pl: Trwa aktualizacja bazy danych. Spróbuj ponownie później

# serverError
source: An unexpected server error has occurred. Try again later
pl: Wystąpił nieoczekiwany błąd serwera. Spróbuj ponownie później

source: Select date
pl: Wybierz datę

source: No internet connection
pl: Brak połączenia do internetu

source: Unknown error
pl: Nieznany błąd

source: Back
pl: Cofnij

# pick
source: Select
pl: Wybierz

source: Cancel
pl: Anuluj

source: Copy
pl: Kopiuj

# aboutApiDescription
source: Aplication fetch data from Polish National Revenue Administration API
pl: Aplikacja pobiera dane poprzez API wystawione przez Ministerstwo Finansów - Krajową Administracje Skarbową

# aboutOpenSource
source: Opensource libraries used by this app
pl: Biblioteki opensource wykorzystywane przez aplikację
